Update tech Specs Epic 0 and 1
